sobczyk/bsp/csps/lpc32xx/source/lpc32xx_clkpwr_driver.c
/***********************************************************************
 * $Id:: lpc32xx_clkpwr_driver.c 2398 2009-10-28 00:21:31Z wellsk      $
 *
 * Project: LPC32xx SLC NAND controller driver
 *
 * Description:
 *     This file contains driver support for the LPC32xx SLC NAND
 *     controller.
 *
 ***********************************************************************
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * products. This software is supplied "AS IS" without any warranties.
 * NXP Semiconductors assumes no responsibility or liability for the
 * use of the software, conveys no license or title under any patent,
 * copyright, or mask work right to the product. NXP Semiconductors
 * reserves the right to make changes in the software without
 * notification. NXP Semiconductors also make no representation or
 * warranty that such application will be suitable for the specified
 * use without further testing or modification.
 *********************************************************************/

#include "lpc32xx_clkpwr_driver.h"

#ifdef __ICCARM__
#include "intrinsics.h"
#endif

/***********************************************************************
 * SLC NAND controller driver package data
***********************************************************************/

/* Structure containing event register pointers */
typedef struct
{
  volatile UNS_32 *start_er;
  volatile UNS_32 *start_sr;
  volatile UNS_32 *start_rsr;
  volatile UNS_32 *start_apr;
} CLKPWR_EVENTREG_GROUP_T;

/* Normal base clocks for peripherals */
CLKPWR_BASE_CLOCK_T clkpwr_base_clk[CLKPWR_LAST_CLK] =
{
  CLKPWR_HCLK,       /* CLKPWR_USB_HCLK */
  CLKPWR_HCLK,       /* CLKPWR_LCD_CLK */
  CLKPWR_HCLK,       /* CLKPWR_SSP1_CLK */
  CLKPWR_HCLK,       /* CLKPWR_SSP0_CLK */
  CLKPWR_HCLK,       /* CLKPWR_I2S1_CLK */
  CLKPWR_HCLK,       /* CLKPWR_I2S0_CLK */
  CLKPWR_ARM_CLK,    /* CLKPWR_MSCARD_CLK */
  CLKPWR_HCLK,       /* CLKPWR_MAC_DMA_CLK */
  CLKPWR_HCLK,       /* CLKPWR_MAC_MMIO_CLK */
  CLKPWR_HCLK,       /* CLKPWR_MAC_HRC_CLK */
  CLKPWR_HCLK,       /* CLKPWR_I2C2_CLK */
  CLKPWR_HCLK,       /* CLKPWR_I2C1_CLK */
  CLKPWR_RTC_CLK,    /* CLKPWR_KEYSCAN_CLK */
  CLKPWR_RTC_CLK,    /* CLKPWR_ADC_CLK */
  CLKPWR_RTC_CLK,    /* CLKPWR_PWM2_CLK */
  CLKPWR_RTC_CLK,    /* CLKPWR_PWM1_CLK */
  CLKPWR_PERIPH_CLK, /* CLKPWR_HSTIMER_CLK */
  CLKPWR_PERIPH_CLK, /* CLKPWR_WDOG_CLK */
  CLKPWR_PERIPH_CLK, /* CLKPWR_TIMER3_CLK */
  CLKPWR_PERIPH_CLK, /* CLKPWR_TIMER2_CLK */
  CLKPWR_PERIPH_CLK, /* CLKPWR_TIMER1_CLK */
  CLKPWR_PERIPH_CLK, /* CLKPWR_TIMER0_CLK */
  CLKPWR_PERIPH_CLK, /* CLKPWR_PWM4_CLK */
  CLKPWR_PERIPH_CLK, /* CLKPWR_PWM3_CLK */
  CLKPWR_HCLK,       /* CLKPWR_SPI2_CLK */
  CLKPWR_HCLK,       /* CLKPWR_SPI1_CLK */
  CLKPWR_HCLK,       /* CLKPWR_NAND_SLC_CLK */
  CLKPWR_HCLK,       /* CLKPWR_NAND_MLC_CLK */
  CLKPWR_PERIPH_CLK, /* CLKPWR_UART6_CLK */
  CLKPWR_PERIPH_CLK, /* CLKPWR_UART5_CLK */
  CLKPWR_PERIPH_CLK, /* CLKPWR_UART4_CLK */
  CLKPWR_PERIPH_CLK, /* CLKPWR_UART3_CLK */
  CLKPWR_HCLK,       /* CLKPWR_DMA_CLK */
  CLKPWR_DDR_CLK     /* CLKPWR_SDRAMDDR_CLK */
};

/* Post divider values for PLLs based on selected register value */
static UNS_32 pll_postdivs[4] =
{
  1, 2, 4, 8
};

/* CLK divider values for HCLK based on selected register value */
static UNS_32 hclkdivs[4] =
{
  1, 2, 4, 4
};

/***********************************************************************
 * CLKPWR controller driver public functions
 **********************************************************************/

/***********************************************************************
 *
 * Function: clkpwr_abs
 *
 * Purpose: ABS difference function
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     v1 : Value 1 for ABS
 *     v2 : Value 2 for ABS
 *
 * Outputs: None
 *
 * Returns: Absolute difference between the 2 values
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 clkpwr_abs(INT_32 v1, INT_32 v2)
{
  if (v1 > v2)
  {
    return v1 - v2;
  }

  return v2 - v1;
}

/***********************************************************************
 *
 * Function: clkpwr_check_pll_setup
 *
 * Purpose: Determines if a PLL setup is valid
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     ifreq    : PLL input frequency
 *     pllsetup : Pointer to PLL setup structure
 *
 * Outputs: None
 *
 * Returns: Computed PLL frequency or 0 if invalid
 *
 * Notes: Used for PLL setup value verification.
 *
 **********************************************************************/
UNS_32 clkpwr_check_pll_setup(UNS_32 ifreq,
                              CLKPWR_HCLK_PLL_SETUP_T *pllsetup)
{
  UNS_64 i64freq, p, m, n, fcco = 0, fref = 0, cfreq = 0;
  INT_32 mode;

  /* PLL requirements */
  /* ifreq must be >= 1MHz and <= 20MHz */
  /* FCCO must be >= 156MHz and <= 320MHz */
  /* FREF must be >= 1MHz and <= 27MHz. */
  /* Assume the passed input data is not valid */

  /* Work with 64-bit values to prevent overflow */
  i64freq = (UNS_64) ifreq;
  m = (UNS_64) pllsetup->pll_m;
  n = (UNS_64) pllsetup->pll_n;
  p = (UNS_64) pllsetup->pll_p;

  /* Get components of the PLL register */
  mode = (pllsetup->cco_bypass_b15 << 2) |
         (pllsetup->direct_output_b14 << 1) |
         pllsetup->fdbk_div_ctrl_b13;
  switch (mode)
  {
    case 0x0: /* Non-integer mode */
      cfreq = (m * i64freq) / (2 * p * n);
      fcco = (m * i64freq) / n;
      fref = i64freq / n;
      break;

    case 0x1: /* integer mode */
      cfreq = (m * i64freq) / n;
      fcco = (m * i64freq) / (n * 2 * p);
      fref = i64freq / n;
      break;

    case 0x2:
    case 0x3: /* Direct mode */
      cfreq = (m * i64freq) / n;
      fcco = cfreq;
      fref = i64freq / n;
      break;

    case 0x4:
    case 0x5: /* Bypass mode */
      cfreq = i64freq / (2 * p);
      fcco = 156000000;
      fref = 1000000;
      break;

    case 0x6:
    case 0x7: /* Direct bypass mode */
      cfreq = i64freq;
      fcco = 156000000;
      fref = 1000000;
      break;
  }

  if ((fcco < 156000000) || (fcco > 320000000))
  {
    /* not a valid range */
    cfreq = 0;
  }

  if ((fref < 1000000) || (fref > 27000000))
  {
    /* not a valid range */
    cfreq = 0;
  }

