sobczyk/bsp/csps/lpc32xx/source/lpc32xx_clkpwr_driver.c
  return (INT_32) cfreq;
}

/***********************************************************************
 *
 * Function: clkpwr_pll_rate_from_val
 *
 * Purpose: Compute a PLL's frequency from a PLL register value
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     osc_rate : PLL input clock in Hz
 *     val      : 32-bit register value
 *
 * Outputs: None
 *
 * Returns: The PLL output frequency in Hz, or 0
 *
 * Notes: None
 *
 **********************************************************************/
UNS_32 clkpwr_pll_rate_from_val(UNS_32 osc_rate,
                                UNS_32 val)
{
  CLKPWR_HCLK_PLL_SETUP_T pllcfg;

  /* Get components of the PLL register */
  pllcfg.cco_bypass_b15 = 0;
  pllcfg.direct_output_b14 = 0;
  pllcfg.fdbk_div_ctrl_b13 = 0;
  if ((val & CLKPWR_HCLKPLL_CCO_BYPASS) != 0)
  {
    pllcfg.cco_bypass_b15 = 1;
  }
  if ((val & CLKPWR_HCLKPLL_POSTDIV_BYPASS) != 0)
  {
    pllcfg.direct_output_b14 = 1;
  }
  if ((val & CLKPWR_HCLKPLL_FDBK_SEL_FCLK) != 0)
  {
    pllcfg.fdbk_div_ctrl_b13 = 1;
  }
  pllcfg.pll_m = 1 + ((val >> 1) & 0xFF);
  pllcfg.pll_n = 1 + ((val >> 9) & 0x3);
  pllcfg.pll_p = pll_postdivs[((val >> 11) & 0x3)];

  return clkpwr_check_pll_setup(osc_rate, &pllcfg);
}

/***********************************************************************
 *
 * Function: clkpwr_pll_rate
 *
 * Purpose: Compute a PLL's frequency
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     osc_rate : PLL input clock in Hz
 *     pPllreg  : Pointer to PLL register set
 *
 * Outputs: None
 *
 * Returns: The PLL output frequency in Hz, or 0
 *
 * Notes: None
 *
 **********************************************************************/
UNS_32 clkpwr_pll_rate(UNS_32 osc_rate,
                       UNS_32 *pPllreg)
{
  return clkpwr_pll_rate_from_val(osc_rate, *pPllreg);
}

/***********************************************************************
 *
 * Function: clkpwr_mask_and_set
 *
 * Purpose: Set or mask off a specific field or bit
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     pReg : Pointer to address to modify
 *     mask : Mask to apply to value
 *     set  : '1' = mask and set, '0' = mask only
 *
 * Outputs: None
 *
 * Returns: '1' if the selected PLL oscillator is locked, otherwise 0
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_mask_and_set(volatile UNS_32 *pReg,
                         UNS_32 mask,
                         UNS_32 set)
{
  UNS_32 tmp;

  tmp = *pReg & ~mask;
  if (set != 0)
  {
    tmp |= mask;
  }
  *pReg = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_get_event_field
 *
 * Purpose: Get register and bit position for an event ID
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     event_id : Event enumeration to change
 *     pReg     : Pointer to where to save register addresses
 *     bitnum   : Bit number mapped to event
 *
 * Outputs: None
 *
 * Returns: 1 if a valid event_id, otherwise 0
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 clkpwr_get_event_field(CLKPWR_EVENT_T event_id,
                              CLKPWR_EVENTREG_GROUP_T *pReg,
                              INT_32 *bitnum)
{
  INT_32 status = 0;

  if (event_id < CLKPWR_SOURCES_EXT_BASE)
  {
    pReg->start_er = &CLKPWR->clkpwr_int_er;
    pReg->start_sr = &CLKPWR->clkpwr_int_sr;
    pReg->start_rsr = &CLKPWR->clkpwr_int_rs;
    pReg->start_apr = &CLKPWR->clkpwr_int_ap;
    *bitnum = (INT_32)event_id;
    status = 1;
  }
  else if (event_id < CLKPWR_SOURCES_GPIO_BASE)
  {
    pReg->start_er = &CLKPWR->clkpwr_pin_er;
    pReg->start_sr = &CLKPWR->clkpwr_pin_sr;
    pReg->start_rsr = &CLKPWR->clkpwr_pin_rs;
    pReg->start_apr = &CLKPWR->clkpwr_pin_ap;
    *bitnum = (INT_32)(CLKPWR_SOURCES_GPIO_BASE - event_id);
    status = 1;
  }
  else if (event_id < CLKPWR_EVENT_LAST)
  {
    pReg->start_er = &CLKPWR->clkpwr_p01_er;
    pReg->start_sr = NULL;
    pReg->start_rsr = NULL;
    pReg->start_apr = NULL;
    *bitnum = (INT_32)(CLKPWR_EVENT_LAST - event_id);
    status = 1;
  }

  return status;
}

/***********************************************************************
 *
 * Function: clkpwr_get_base_clock
 *
 * Purpose: Get the base clock for a main clock
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     ipclk : Clock to get the rate of
 *
 * Outputs: None
 *
 * Returns: The base clock for the selected clock.
 *
 * Notes: None
 *
 **********************************************************************/
CLKPWR_BASE_CLOCK_T clkpwr_get_base_clock(CLKPWR_CLK_T ipclk)
{
  CLKPWR_BASE_CLOCK_T baseclk = CLKPWR_BASE_INVALID;

  if (ipclk <= CLKPWR_LAST_CLK)
  {
    /* Get base clock for the selected clock */
    baseclk = clkpwr_base_clk[ipclk];

    /* Do default clocks need to be overrided? */
    switch (ipclk)
    {
      case CLKPWR_ADC_CLK:
        /* Is the peripheral clock used? */
        if ((CLKPWR->clkpwr_adc_clk_ctrl_1 &
             CLKPWR_ADCCTRL1_PCLK_SEL) != 0)
        {
          baseclk = CLKPWR_PERIPH_CLK;
        }
        break;

      case CLKPWR_PWM2_CLK:
        /* Is the peripheral clock used? */
        if ((CLKPWR->clkpwr_pwm_clk_ctrl &
             CLKPWR_PWMCLK_PWM2SEL_PCLK) != 0)
        {
          baseclk = CLKPWR_PERIPH_CLK;
        }
        break;

      case CLKPWR_PWM1_CLK:
        /* Is the peripheral clock used? */
        if ((CLKPWR->clkpwr_pwm_clk_ctrl &
             CLKPWR_PWMCLK_PWM1SEL_PCLK) != 0)
        {
          baseclk = CLKPWR_PERIPH_CLK;
        }
        break;

      default:
        break;
    }

  }

  return baseclk;
}

/**********************************************************************
 * Clock control functions
 *********************************************************************/

/***********************************************************************
 *
 * Function: clkpwr_find_pll_cfg
 *
 * Purpose:
 *     Find a PLL configuration for the selected frequency and
 *     tolerance (in .1% increments), returns the actual frequency of
 *     the PLL for the configuration
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     pllin_freq  : Frequency into the PLL
 *     target_freq : Frequency in Hz to compute PLL values for
 *     tol_001     : Tolerance in 1/10th of a percent for target frequency
 *     pllsetup    : Pointer to PLL config structure to fill
 *
 * Outputs: None
 *
 * Returns: New configured frequency, or '0' if an error occurs
 *
 * Notes: None
 *
 **********************************************************************/
UNS_32 clkpwr_find_pll_cfg(UNS_32 pllin_freq,
                           UNS_32 target_freq,
                           INT_32 tol_001,
                           CLKPWR_HCLK_PLL_SETUP_T *pllsetup)
{
  UNS_32 ifreq, freqtol, m, n, p, fclkout = 0;
  UNS_32 flag = 0, freqret = 0;
  UNS_64 lfreqtol;

  /* Determine frequency tolerance limits */
  lfreqtol = ((UNS_64) target_freq * (UNS_64) tol_001) / 1000;
  freqtol = (INT_32) lfreqtol;

  /* Get PLL clock */
  ifreq = pllin_freq;

  /* Is direct bypass mode possible? */
  if (clkpwr_abs(pllin_freq, target_freq) <= freqtol)
  {
    flag = 1;
    pllsetup->analog_on = 0;
    pllsetup->cco_bypass_b15 = 1; /* Bypass CCO */
    pllsetup->direct_output_b14 = 1; /* Bypass post divider */
    pllsetup->fdbk_div_ctrl_b13 = 1;
    pllsetup->pll_p = pll_postdivs[0]; /* Doesn't matter */
    pllsetup->pll_n = 1; /* Doesn't matter */
    pllsetup->pll_m = 1; /* Doesn't matter */
    fclkout = clkpwr_check_pll_setup(ifreq, pllsetup);
  }
  else if (target_freq <= ifreq) /* Is bypass mode possible? */
  {
    pllsetup->analog_on = 0;
    pllsetup->cco_bypass_b15 = 1; /* Bypass CCO */
    pllsetup->direct_output_b14 = 0;
    pllsetup->fdbk_div_ctrl_b13 = 1;
    pllsetup->pll_n = 1; /* Doesn't matter */
    pllsetup->pll_m = 1; /* Doesn't matter */
    for (p = 0; ((p <= 3) && (flag == 0)); p++)
    {
      pllsetup->pll_p = pll_postdivs[p];
      fclkout = clkpwr_check_pll_setup(ifreq, pllsetup);
      if (clkpwr_abs(target_freq, fclkout) <= freqtol)
      {
        /* Found a matching frequency */
        flag = 1;
      }
    }
  }

  /* Is direct mode possible? */
  if (flag == 0)
  {
    pllsetup->analog_on = 1;
    pllsetup->cco_bypass_b15 = 0; /* Bypass CCO */
    pllsetup->direct_output_b14 = 1;
    pllsetup->fdbk_div_ctrl_b13 = 0;
    pllsetup->pll_p = pll_postdivs[0];
    for (m = 1; ((m <= 256) && (flag == 0)); m++)
    {
      for (n = 1; ((n <= 4) && (flag == 0)); n++)
      {
        /* Compute output frequency for this value */
        pllsetup->pll_n = n;
        pllsetup->pll_m = m;
        fclkout = clkpwr_check_pll_setup(ifreq, pllsetup);
        if (clkpwr_abs(target_freq, fclkout) <= freqtol)
        {
          flag = 1;
        }
      }
    }
  }

