sobczyk/bsp/csps/lpc32xx/source/lpc32xx_clkpwr_driver.c
  /* Is integer mode possible? */
  if (flag == 0)
  {
    /* Bypass and direct modes won't work with this frequency, so
       integer mode may need to be used */
    pllsetup->analog_on = 1;
    pllsetup->cco_bypass_b15 = 0;
    pllsetup->direct_output_b14 = 0;
    pllsetup->fdbk_div_ctrl_b13 = 1;
    for (m = 1; ((m <= 256) && (flag == 0)); m++)
    {
      for (n = 1; ((n <= 4) && (flag == 0)); n++)
      {
        for (p = 0; ((p < 4) && (flag == 0)); p++)
        {
          /* Compute output frequency for this value */
          pllsetup->pll_p = pll_postdivs[p];
          pllsetup->pll_n = n;
          pllsetup->pll_m = m;
          fclkout = clkpwr_check_pll_setup(ifreq, pllsetup);
          if (clkpwr_abs(target_freq, fclkout) <= freqtol)
          {
            flag = 1;
          }
        }
      }
    }
  }

  if (flag == 0)
  {
    /* Try non-integer mode */
    pllsetup->analog_on = 1;
    pllsetup->cco_bypass_b15 = 0;
    pllsetup->direct_output_b14 = 0;
    pllsetup->fdbk_div_ctrl_b13 = 0;
    for (m = 1; ((m <= 256) && (flag == 0)); m++)
    {
      for (n = 1; ((n <= 4) && (flag == 0)); n++)
      {
        for (p = 0; ((p < 4) && (flag == 0)); p++)
        {
          /* Compute output frequency for this value */
          pllsetup->pll_p = pll_postdivs[p];
          pllsetup->pll_n = n;
          pllsetup->pll_m = m;
          fclkout = clkpwr_check_pll_setup(ifreq, pllsetup);
          if (clkpwr_abs(target_freq, fclkout) <= freqtol)
          {
            flag = 1;
          }
        }
      }
    }
  }

  if (flag == 1)
  {
    freqret = fclkout;
  }

  return freqret;
}

/***********************************************************************
 *
 * Function: clkpwr_pll397_setup
 *
 * Purpose: Setup the PLL397 oscillator
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     bypass_enable : (1) to enable bypass, (0) to disable bypass mode
 *     bias : Must be a macro of type CLKPWR_PLL397_BIAS_xxxx
 *     enable : (1) to enable, (0) to disable
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_pll397_setup(INT_32 bypass_enable,
                         UNS_32 bias,
                         INT_32 pll_enable)
{
  volatile UNS_32 tmp;

  tmp = CLKPWR->clkpwr_pll397_ctrl & ~(CLKPWR_PLL397_BYPASS |
                                       CLKPWR_PLL397_BIAS_MASK |
									   CLKPWR_SYSCTRL_PLL397_DIS);

  if (bypass_enable != 0)
  {
    tmp = tmp | CLKPWR_PLL397_BYPASS;
  }
  tmp = tmp | bias;

  if (pll_enable == 0)
  {
    tmp = tmp | CLKPWR_SYSCTRL_PLL397_DIS;
  }

  CLKPWR->clkpwr_pll397_ctrl = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_hclkpll_setup
 *
 * Purpose: Setup the HCLK PLL with a PLL structure
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     pHCLKPllSetup : Pointer to a HCLK PLL setup structure
 *
 * Outputs: None
 *
 * Returns: 1 if the PLL was setup ok, otherwise 0 if no change
 *
 * Notes: The PLL will be disabled out of this function.
 *
 **********************************************************************/
INT_32 clkpwr_hclkpll_setup(CLKPWR_HCLK_PLL_SETUP_T *pHCLKPllSetup)
{
  UNS_32 tv, tmp = 0;

  if (pHCLKPllSetup->analog_on != 0)
  {
    tmp |= CLKPWR_HCLKPLL_POWER_UP;
  }
  if (pHCLKPllSetup->cco_bypass_b15 != 0)
  {
    tmp |= CLKPWR_HCLKPLL_CCO_BYPASS;
  }
  if (pHCLKPllSetup->direct_output_b14 != 0)
  {
    tmp |= CLKPWR_HCLKPLL_POSTDIV_BYPASS;
  }
  if (pHCLKPllSetup->fdbk_div_ctrl_b13 != 0)
  {
    tmp |= CLKPWR_HCLKPLL_FDBK_SEL_FCLK;
  }

  switch (pHCLKPllSetup->pll_p)
  {
    case 1:
      tv = 0;
      break;

    case 2:
      tv = 1;
      break;

    case 4:
      tv = 2;
      break;

    case 8:
      tv = 3;
      break;

    default:
      return 0;
  }
  tmp |= CLKPWR_HCLKPLL_POSTDIV_2POW(tv);
  tmp |= CLKPWR_HCLKPLL_PREDIV_PLUS1(pHCLKPllSetup->pll_n - 1);
  tmp |= CLKPWR_HCLKPLL_PLLM(pHCLKPllSetup->pll_m - 1);

  CLKPWR->clkpwr_hclkpll_ctrl = tmp;

  return clkpwr_check_pll_setup(
           clkpwr_get_base_clock_rate(CLKPWR_SYSCLK), pHCLKPllSetup);
}

/***********************************************************************
 *
 * Function: clkpwr_usbclkpll_setup
 *
 * Purpose: Setup the USB PLL with a PLL structure
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     pHCLKPllSetup : Pointer to a HCLK PLL setup structure
 *
 * Outputs: None
 *
 * Returns: 1 if the PLL was setup ok, otherwise 0 if no change
 *
 * Notes: The PLL will be disabled out of this function. USB and HCLK
 *        PLL structures are identical.
 *
 **********************************************************************/
INT_32 clkpwr_usbclkpll_setup(CLKPWR_HCLK_PLL_SETUP_T *pHCLKPllSetup)
{
  UNS_32 tv, tmp = 0;

  if (pHCLKPllSetup->analog_on != 0)
  {
    tmp |= CLKPWR_HCLKPLL_POWER_UP;
  }
  if (pHCLKPllSetup->cco_bypass_b15 != 0)
  {
    tmp |= CLKPWR_HCLKPLL_CCO_BYPASS;
  }
  if (pHCLKPllSetup->direct_output_b14 != 0)
  {
    tmp |= CLKPWR_HCLKPLL_POSTDIV_BYPASS;
  }
  if (pHCLKPllSetup->fdbk_div_ctrl_b13 != 0)
  {
    tmp |= CLKPWR_HCLKPLL_FDBK_SEL_FCLK;
  }

  switch (pHCLKPllSetup->pll_p)
  {
    case 1:
      tv = 0;
      break;

    case 2:
      tv = 1;
      break;

    case 4:
      tv = 2;
      break;

    case 8:
      tv = 3;
      break;

    default:
      return 0;
  }
  tmp |= CLKPWR_HCLKPLL_POSTDIV_2POW(tv);
  tmp |= CLKPWR_HCLKPLL_PREDIV_PLUS1(pHCLKPllSetup->pll_n - 1);
  tmp |= CLKPWR_HCLKPLL_PLLM(pHCLKPllSetup->pll_m - 1);

  CLKPWR->clkpwr_usb_ctrl = tmp;

//  return 1;
  return clkpwr_check_pll_setup(
           clkpwr_get_base_clock_rate(CLKPWR_SYSCLK), pHCLKPllSetup);
}

/***********************************************************************
 *
 * Function: clkpwr_hclkpll_direct_setup
 *
 * Purpose: Setup the HCLK PLL with a direct value
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     pllsetupval : PLL direct setup value
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: The PLL will be disabled out of this function.
 *
 **********************************************************************/
void clkpwr_hclkpll_direct_setup(UNS_32 pllsetupval)
{
  CLKPWR->clkpwr_hclkpll_ctrl = pllsetupval;
}

/***********************************************************************
 *
 * Function: clkpwr_pll_dis_en
 *
 * Purpose: Enable or disable a PLL
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     pll    : PLL to enable or disable
 *     enable : 0 to disable, 1 to enable
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_pll_dis_en(CLKPWR_PLL_T pll,
                       INT_32 enable)
{
  switch (pll)
  {
    case CLKPWR_PLL397:
      if (enable == 0)
      {
        CLKPWR->clkpwr_pll397_ctrl |= CLKPWR_SYSCTRL_PLL397_DIS;
      }
      else
      {
        CLKPWR->clkpwr_pll397_ctrl &= ~CLKPWR_SYSCTRL_PLL397_DIS;
      }
      break;

    case CLKPWR_HCLK_PLL:
      if (enable != 0)
      {
        CLKPWR->clkpwr_hclkpll_ctrl |= CLKPWR_HCLKPLL_POWER_UP;
      }
      else
      {
        CLKPWR->clkpwr_hclkpll_ctrl &= ~CLKPWR_HCLKPLL_POWER_UP;
      }
      break;

    case CLKPWR_USB_PLL:
      if (enable != 0)
      {
        CLKPWR->clkpwr_usb_ctrl |= CLKPWR_USBCTRL_PLL_PWRUP;
      }
      else
      {
        CLKPWR->clkpwr_usb_ctrl &= ~CLKPWR_USBCTRL_PLL_PWRUP;
      }
      break;

    default:
      break;
  }
}

/***********************************************************************
 *
 * Function: clkpwr_is_pll_locked
 *
 * Purpose: Get a PLL lock status
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     pll : PLL to check the status of
 *
 * Outputs: None
 *
 * Returns: '1' if the selected PLL oscillator is locked, otherwise 0
 *
 * Notes:
 *     If the analog is disabled for the HCKL or USB PLL, it may still
 *     provide a clock, but never a locked status. In these cases, a
 *     simulated lock status is returned.
 *
 **********************************************************************/
INT_32 clkpwr_is_pll_locked(CLKPWR_PLL_T pll)
{
  INT_32 locked = 0;

  switch (pll)
  {
    case CLKPWR_PLL397:
      if ((CLKPWR->clkpwr_pll397_ctrl &
           CLKPWR_SYSCTRL_PLL397_STS) != 0)
      {
        locked = 1;
      }
      break;

    case CLKPWR_HCLK_PLL:
      if ((CLKPWR->clkpwr_hclkpll_ctrl &
           CLKPWR_HCLKPLL_PLL_STS) != 0)
      {
        locked = 1;
      }
      else if ((CLKPWR->clkpwr_hclkpll_ctrl &
                CLKPWR_HCLKPLL_POWER_UP) == 0)
      {
        /* Simulated status */
        locked = 1;
      }
      break;

    case CLKPWR_USB_PLL:
      if ((CLKPWR->clkpwr_usb_ctrl &
           CLKPWR_USBCTRL_PLL_STS) != 0)
      {
        locked = 1;
      }
      else if ((CLKPWR->clkpwr_usb_ctrl &
                CLKPWR_USBCTRL_PLL_PWRUP) == 0)
      {
        /* Simulated status */
        locked = 1;
      }
      break;

    default:
      break;
  }

