sobczyk/bsp/csps/lpc32xx/source/lpc32xx_clkpwr_driver.c
  return locked;
}

/***********************************************************************
 *
 * Function: clkpwr_mainosc_setup
 *
 * Purpose: Setup the main oscillator
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     capload_add : adds 0 to 12.7pF, or 0.1pF per increment
 *     osc_enable  : (1) to enable, (0) to disable
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_mainosc_setup(UNS_32 capload_add,
                          INT_32 osc_enable)
{
  volatile UNS_32 tmp;

  /* Read current register value and mask off cap load value */
  tmp = CLKPWR->clkpwr_main_osc_ctrl & ~(CLKPWR_MOSC_CAP_MASK |
                                         CLKPWR_MOSC_DISABLE |
										 CLKPWR_SYSCTRL_BP_MASK);

  /* Add in new cap load value */
  tmp = tmp | CLKPWR_MOSC_ADD_CAP(capload_add);

  if (osc_enable == 0)
  {
    tmp = tmp | CLKPWR_MOSC_DISABLE;
  }

  CLKPWR->clkpwr_main_osc_ctrl = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_sysclk_setup
 *
 * Purpose: Setup the system clocking
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     osc   : Selected oscillator to use
 *     bpval : Bad phase clock switch value
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_sysclk_setup(CLKPWR_OSC_T osc,
                         INT_32 bpval)
{
  volatile UNS_32 tmp;

  tmp = CLKPWR->clkpwr_sysclk_ctrl & ~(CLKPWR_SYSCTRL_BP_MASK |
                                       CLKPWR_SYSCTRL_USEPLL397);

  tmp = tmp | CLKPWR_SYSCTRL_BP_TRIG(bpval);
  switch (osc)
  {
    case CLKPWR_PLL397_OSC:
      tmp = tmp | CLKPWR_SYSCTRL_USEPLL397;
      break;

    case CLKPWR_MAIN_OSC:
    default:
      break;
  }

  CLKPWR->clkpwr_sysclk_ctrl = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_get_osc
 *
 * Purpose: Determine which oscillator is selected
 *
 * Processing:
 *     See function.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Oscillator enumeration for active oscillator
 *
 * Notes: None
 *
 **********************************************************************/
CLKPWR_OSC_T clkpwr_get_osc(void)
{
  CLKPWR_OSC_T sosc = CLKPWR_MAIN_OSC;
  if ((CLKPWR->clkpwr_sysclk_ctrl & CLKPWR_SYSCTRL_SYSCLKMUX) != 0)
  {
    sosc = CLKPWR_PLL397_OSC;
  }

  return sosc;
}

/***********************************************************************
 *
 * Function: clkpwr_set_hclk_divs
 *
 * Purpose: Setup the HCLK dividers
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     dram_clk_div   : CLKPWR_HCLKDIV_DDRCLK_xx value
 *     periph_clk_div : Must be 1 to 256, peripheral clock divider
 *     hclk_div_val   : Must be 1, 2, or 4
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_set_hclk_divs(UNS_32 dram_clk_div,
                          INT_32 periph_clk_div,
                          INT_32 hclk_div_val)
{
  UNS_32 hclkval = 0;

  switch (hclk_div_val)
  {
    case 1:
      hclkval = 0;
      break;

    case 2:
      hclkval = 1;
      break;

    case 4:
    default:
      hclkval = 2;
      break;
  }

  CLKPWR->clkpwr_hclk_div = (dram_clk_div |
    CLKPWR_HCLKDIV_PCLK_DIV(periph_clk_div - 1) |
    CLKPWR_HCLKDIV_DIV_2POW(hclkval));
}

/***********************************************************************
 *
 * Function: clkpwr_get_base_clock_rate
 *
 * Purpose: Get the clock frequency for a base clock
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     baseclk : Base clock to get the rate of
 *
 * Outputs: None
 *
 * Returns:
 *     The current clock rate for the selected peripheral in Hz, or 0
 *     if the clock rate can't be determined.
 *
 * Notes: None
 *
 **********************************************************************/
UNS_32 clkpwr_get_base_clock_rate(CLKPWR_BASE_CLOCK_T baseclk)
{
  UNS_32 sys_clk, ddr_clock, ddr_hclk_div, hclkpll_clk, periph_clk;
  UNS_32 tmp, hclk1_clk, arm1_clk, hclk_clk, arm_clk, clkrate;

  /* Is PLL397 oscillator being used? */
  if ((CLKPWR->clkpwr_sysclk_ctrl & CLKPWR_SYSCTRL_USEPLL397) != 0)
  {
    /* PLL397 is used */
    sys_clk = CLOCK_OSC_FREQ * 397;
  }
  else
  {
    sys_clk = MAIN_OSC_FREQ;
  }

  /* Compute HCLK DDR divider */
  ddr_hclk_div = 0;
  if ((CLKPWR->clkpwr_sdramclk_ctrl & CLKPWR_SDRCLK_USE_DDR) != 0)
  {
    /* DDR is being used */
    if ((CLKPWR->clkpwr_hclk_div & CLKPWR_HCLKDIV_DDRCLK_NORM) != 0)
    {
      ddr_hclk_div = 1;
    }
    else if ((CLKPWR->clkpwr_hclk_div &
              CLKPWR_HCLKDIV_DDRCLK_HALF) != 0)
    {
      ddr_hclk_div = 2;
    }
  }
  else
  {
    /* SDRAM is being used */
    tmp = CLKPWR->clkpwr_hclk_div & CLKPWR_HCLKDIV_DIV_2POW(0x3);
    ddr_hclk_div = hclkdivs[tmp] - 1;
  }

  /* Is the device in run mode? */
  if ((CLKPWR->clkpwr_pwr_ctrl & CLKPWR_SELECT_RUN_MODE) != 0)
  {
    /* In run mode */

    /* Compute HCLK PLL rate */
    hclkpll_clk = clkpwr_pll_rate(sys_clk,
      (UNS_32 *) & CLKPWR->clkpwr_hclkpll_ctrl);

    /* Base DDR rate */
    ddr_clock = hclkpll_clk;

    /* Base peripheral clock rate */
    tmp = 1 + ((CLKPWR->clkpwr_hclk_div >> 2) & 0x1F);
    periph_clk = hclkpll_clk / tmp;

    /* Base HCLK rate (when not using peripheral clock */
    hclk1_clk = hclkpll_clk /
     hclkdivs[CLKPWR_HCLKDIV_DIV_2POW(CLKPWR->clkpwr_hclk_div)];

    /* Base ARM clock (when not using peripheral clock */
    arm1_clk = hclkpll_clk;
  }
  else
  {
    /* In direct-run mode */

    /* Base DDR rate */
    ddr_clock = sys_clk;

    /* Base peripheral clock rate */
    periph_clk = sys_clk;

    /* Base HCLK rate (when not using peripheral clock */
    hclk1_clk = sys_clk;

    /* Base ARM clock (when not using peripheral clock */
    arm1_clk = sys_clk;
  }

  /* Compute SDRAM/DDR clock */
  ddr_clock = ddr_clock / (ddr_hclk_div + 1);

