sobczyk/bsp/csps/lpc32xx/source/lpc32xx_clkpwr_driver.c
  /* Compute HCLK and ARM clock rates */
  if ((CLKPWR->clkpwr_pwr_ctrl & CLKPWR_CTRL_FORCE_PCLK) != 0)
  {
    /* HCLK and ARM clock run from peripheral clock */
    hclk_clk = periph_clk;
    arm_clk = periph_clk;
  }
  else
  {
    /* Normal clock is used for HCLK and ARM clock */
    hclk_clk = hclk1_clk;
    arm_clk = arm1_clk;
  }

  /* Determine rates */
  switch (baseclk)
  {
    case CLKPWR_MAINOSC_CLK:
      /* Main oscillator rate */
      clkrate = MAIN_OSC_FREQ;
      break;

    case CLKPWR_RTC_CLK:
      /* RTC oscillator rate */
      clkrate = CLOCK_OSC_FREQ;
      break;

    case CLKPWR_SYSCLK:
      /* System oscillator (main osc or PLL397) rate */
      clkrate = sys_clk;
      break;

    case CLKPWR_ARM_CLK:
      clkrate = arm_clk;
      break;

    case CLKPWR_HCLK:
      clkrate = hclk_clk;
      break;

    case CLKPWR_PERIPH_CLK:
      clkrate = periph_clk;
      break;

    case CLKPWR_USB_HCLK_SYS:
      clkrate = 0; // Not supported
      break;

    case CLKPWR_48M_CLK:
      clkrate = 0; // Not supported
      break;

    case CLKPWR_DDR_CLK:
      clkrate = ddr_clock;
      break;

    case CLKPWR_MSSD_CLK:
      clkrate = hclk_clk;
      break;

    default:
      clkrate = 0;
      break;
  }

  return clkrate;
}

/***********************************************************************
 *
 * Function: clkpwr_force_arm_hclk_to_pclk
 *
 * Purpose: Force (or unforce) HCLK and ARM_CLK to run from PERIPH_CLK
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     force : '1' to force HCLK and ARM clock to PERIPH_CLK, '0' normal
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_force_arm_hclk_to_pclk(INT_32 force)
{
  UNS_32 tmp;

  tmp = CLKPWR->clkpwr_pwr_ctrl & ~CLKPWR_CTRL_FORCE_PCLK;
  if (force != 0)
  {
    tmp |= CLKPWR_CTRL_FORCE_PCLK;
  }

  CLKPWR->clkpwr_pwr_ctrl = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_set_mode
 *
 * Purpose: Select operational mode (run, direct run, or stop)
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     freq    : Frequency in Hz to compute PLL values for
 *     tol     : Tolerance in percent for target frequency
 *     pllsetup: Pointer to PLL config structure to fill
 *
 * Outputs: None
 *
 * Returns: '1' if the PLL config is valid, otherwise 0
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_set_mode(CLKPWR_MODE_T mode)
{
  UNS_32 tmp;

  switch (mode)
  {
    case CLKPWR_MD_RUN:
      tmp = CLKPWR->clkpwr_pwr_ctrl | CLKPWR_SELECT_RUN_MODE;
      CLKPWR->clkpwr_pwr_ctrl = tmp;
      break;

    case CLKPWR_MD_DIRECTRUN:
      tmp = CLKPWR->clkpwr_pwr_ctrl & ~CLKPWR_SELECT_RUN_MODE;
      CLKPWR->clkpwr_pwr_ctrl = tmp;
      break;

    case CLKPWR_MODE_STOP:
      tmp = CLKPWR->clkpwr_pwr_ctrl | CLKPWR_STOP_MODE_CTRL;
      CLKPWR->clkpwr_pwr_ctrl = tmp;
      break;

    default:
      break;
  }
}

/***********************************************************************
 *
 * Function: clkpwr_clk_en_dis
 *
 * Purpose: Enable or disable a clock
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     clk    : Clock to enable or disable
 *     enable : '1' to enable, '0' to disable
 *
 * Outputs: None
 *
 * Returns: '1' if the selected PLL oscillator is locked, otherwise 0
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_clk_en_dis(CLKPWR_CLK_T clk,
                       INT_32 enable)
{
  switch (clk)
  {
#if 0 // Not supported
    case CLKPWR_USB_HCLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_pwr_ctrl,
                          CLKPWR_DISABLE_USB_HCLK, !enable);
      break;
#endif
    case CLKPWR_LCD_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_lcdclk_ctrl,
                          CLKPWR_LCDCTRL_CLK_EN, enable);
      break;

    case CLKPWR_SSP1_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_ssp_blk_ctrl,
                          CLKPWR_SSPCTRL_SSPCLK1_EN, enable);
      break;

    case CLKPWR_SSP0_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_ssp_blk_ctrl,
                          CLKPWR_SSPCTRL_SSPCLK0_EN, enable);
      break;

    case CLKPWR_I2S1_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_i2s_clk_ctrl,
                          CLKPWR_I2SCTRL_I2SCLK1_EN, enable);
      break;

    case CLKPWR_I2S0_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_i2s_clk_ctrl,
                          CLKPWR_I2SCTRL_I2SCLK0_EN, enable);
      break;

    case CLKPWR_MSCARD_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_ms_ctrl,
                          CLKPWR_MSCARD_SDCARD_EN, enable);
      if ((CLKPWR->clkpwr_ms_ctrl &
           CLKPWR_MSCARD_SDCARD_DIV(0xF)) == 0)
      {
        /* Set fastest clock */
        CLKPWR->clkpwr_ms_ctrl |= CLKPWR_MSCARD_SDCARD_DIV(1);
      }
      break;

    case CLKPWR_MAC_DMA_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_macclk_ctrl,
                          CLKPWR_MACCTRL_DMACLK_EN, enable);
      break;

    case CLKPWR_MAC_MMIO_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_macclk_ctrl,
                          CLKPWR_MACCTRL_MMIOCLK_EN, enable);
      break;

    case CLKPWR_MAC_HRC_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_macclk_ctrl,
                          CLKPWR_MACCTRL_HRCCLK_EN, enable);
      break;

    case CLKPWR_I2C2_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_i2c_clk_ctrl,
                          CLKPWR_I2CCLK_I2C2CLK_EN, enable);
      break;

    case CLKPWR_I2C1_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_i2c_clk_ctrl,
                          CLKPWR_I2CCLK_I2C1CLK_EN, enable);
      break;

    case CLKPWR_KEYSCAN_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_key_clk_ctrl,
                          CLKPWR_KEYCLKCTRL_CLK_EN, enable);
      break;

