sobczyk/bsp/csps/lpc32xx/source/lpc32xx_clkpwr_driver.c
    case CLKPWR_ADC_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_adc_clk_ctrl,
                          CLKPWR_ADC32CLKCTRL_CLK_EN, enable);
      break;

    case CLKPWR_PWM2_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_pwm_clk_ctrl,
                          CLKPWR_PWMCLK_PWM2CLK_EN, enable);
      break;

    case CLKPWR_PWM1_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_pwm_clk_ctrl,
                          CLKPWR_PWMCLK_PWM1CLK_EN, enable);
      break;

    case CLKPWR_HSTIMER_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_timer_clk_ctrl,
                          CLKPWR_PWMCLK_HSTIMER_EN, enable);
      break;

    case CLKPWR_WDOG_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_timer_clk_ctrl,
                          CLKPWR_PWMCLK_WDOG_EN, enable);
      break;

    case CLKPWR_TIMER3_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_timers_pwms_clk_ctrl_1,
                          CLKPWR_TMRPWMCLK_TIMER3_EN, enable);
      break;

    case CLKPWR_TIMER2_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_timers_pwms_clk_ctrl_1,
                          CLKPWR_TMRPWMCLK_TIMER2_EN, enable);
      break;

    case CLKPWR_TIMER1_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_timers_pwms_clk_ctrl_1,
                          CLKPWR_TMRPWMCLK_TIMER1_EN, enable);
      break;

    case CLKPWR_TIMER0_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_timers_pwms_clk_ctrl_1,
                          CLKPWR_TMRPWMCLK_TIMER0_EN, enable);
      break;

    case CLKPWR_PWM4_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_timers_pwms_clk_ctrl_1,
                          CLKPWR_TMRPWMCLK_PWM4_EN, enable);
      break;

    case CLKPWR_PWM3_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_timers_pwms_clk_ctrl_1,
                          CLKPWR_PWM3_CLK, enable);
      break;

    case CLKPWR_SPI2_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_spi_clk_ctrl,
                          CLKPWR_SPICLK_SPI2CLK_EN, enable);
      break;

    case CLKPWR_SPI1_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_spi_clk_ctrl,
                          CLKPWR_SPICLK_SPI1CLK_EN, enable);
      break;

    case CLKPWR_NAND_SLC_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_nand_clk_ctrl,
                          CLKPWR_NANDCLK_SLCCLK_EN, enable);
      break;

    case CLKPWR_NAND_MLC_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_nand_clk_ctrl,
                          CLKPWR_NANDCLK_MLCCLK_EN, enable);
      break;

    case CLKPWR_UART6_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_uart_clk_ctrl,
                          CLKPWR_UARTCLKCTRL_UART6_EN, enable);
      break;

    case CLKPWR_UART5_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_uart_clk_ctrl,
                          CLKPWR_UARTCLKCTRL_UART5_EN, enable);
      break;

    case CLKPWR_UART4_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_uart_clk_ctrl,
                          CLKPWR_UARTCLKCTRL_UART4_EN, enable);
      break;

    case CLKPWR_UART3_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_uart_clk_ctrl,
                          CLKPWR_UARTCLKCTRL_UART3_EN, enable);
      break;

    case CLKPWR_DMA_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_dmaclk_ctrl,
                          CLKPWR_DMACLKCTRL_CLK_EN, enable);
      break;

    case CLKPWR_SDRAMDDR_CLK:
      clkpwr_mask_and_set(&CLKPWR->clkpwr_sdramclk_ctrl,
                          CLKPWR_SDRCLK_CLK_DIS, !enable);
      break;

    default:
      break;
  }
}

/***********************************************************************
 *
 * Function: clkpwr_autoclk_en_dis
 *
 * Purpose: Enable or disable a autoclock
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     clk    : Clock to set
 *     enable : '1' to enable autoclock, 0 to disable
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_autoclk_en_dis(CLKPWR_AUTOCLK_T clk,
                           INT_32 enable)
{
  volatile UNS_32 tmp;

  switch (clk)
  {
    case CLKPWR_ACLK_USB_DEV:
      tmp = (CLKPWR->clkpwr_autoclock & ~CLKPWR_AUTOCLK_USB_EN);
      if (enable != 0)
      {
        tmp |= CLKPWR_AUTOCLK_USB_EN;
      }
      CLKPWR->clkpwr_autoclock = tmp;
      break;

    case CLKPWR_ACLK_IRAM:
      tmp = (CLKPWR->clkpwr_autoclock & ~CLKPWR_AUTOCLK_IRAM_EN);
      if (enable != 0)
      {
        tmp |= CLKPWR_AUTOCLK_IRAM_EN;
      }
      CLKPWR->clkpwr_autoclock = tmp;
      break;

    case CLKPWR_ACLK_IROM:
      tmp = (CLKPWR->clkpwr_autoclock & ~CLKPWR_AUTOCLK_IROM_EN);
      if (enable != 0)
      {
        tmp |= CLKPWR_AUTOCLK_IROM_EN;
      }
      CLKPWR->clkpwr_autoclock = tmp;
      break;

    default:
      break;
  }
}

/***********************************************************************
 *
 * Function: clkpwr_get_clock_rate
 *
 * Purpose: Get the clock frequency for a specific clocked peripheral
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     ipclk : Clock to get the rate of
 *
 * Outputs: None
 *
 * Returns:
 *     The current clock rate for the selected peripheral in Hz, or 0
 *     if the clock rate can't be determined.
 *
 * Notes: None
 *
 **********************************************************************/
UNS_32 clkpwr_get_clock_rate(CLKPWR_CLK_T ipclk)
{
  CLKPWR_BASE_CLOCK_T baseclk;
  UNS_32 tmp, baseclkrate = 0, divrate = 1;

  /* Get base clock for the selected clock */
  baseclk = clkpwr_get_base_clock(ipclk);
  if (baseclk != CLKPWR_BASE_INVALID)
  {
    /* Based on ipclk, determine possible divders at the clock
    and power control block that apply to the IP clock */
    baseclkrate = clkpwr_get_base_clock_rate(baseclk);
    switch (ipclk)
    {
      case CLKPWR_MSCARD_CLK:
        tmp = CLKPWR->clkpwr_ms_ctrl &
              CLKPWR_MSCARD_SDCARD_DIV(0xF);
        if (tmp == 0)
        {
          baseclkrate = 0;
        }
        else
        {
          divrate = tmp;
        }
        break;

      case CLKPWR_LCD_CLK:
        tmp = (CLKPWR->clkpwr_lcdclk_ctrl &
               CLKPWR_LCDCTRL_PSCALE_MSK);
        divrate = 1 + tmp;
        break;

