sobczyk/bsp/csps/lpc32xx/source/lpc32xx_clkpwr_driver.c
      case CLKPWR_ADC_CLK:
        /* Clock divider only applies when peripheral clock
           is used for ADC clock */
        tmp = CLKPWR->clkpwr_adc_clk_ctrl_1;
        if ((tmp & CLKPWR_ADCCTRL1_PCLK_SEL) != 0)
        {
          tmp = (tmp & CLKPWR_ADCCTRL1_RTDIV(0xF) >> 8);
          if (tmp == 0)
          {
            baseclkrate = 0;
          }
          else
          {
            divrate = tmp;
          }
        }
        break;

      case CLKPWR_PWM2_CLK:
        tmp = (CLKPWR->clkpwr_pwm_clk_ctrl &
               CLKPWR_PWMCLK_PWM2_DIV(0xF) >> 8);
        if (tmp == 0)
        {
          baseclkrate = 0;
        }
        else
        {
          divrate = tmp;
        }
        break;

      case CLKPWR_PWM1_CLK:
        tmp = (CLKPWR->clkpwr_pwm_clk_ctrl &
               CLKPWR_PWMCLK_PWM1_DIV(0xF) >> 4);
        if (tmp == 0)
        {
          baseclkrate = 0;
        }
        else
        {
          divrate = tmp;
        }
        break;

      default:
        break;
    }
  }

  return (baseclkrate / divrate);
}

/***********************************************************************
 *
 * Function: clkpwr_wk_event_en_dis
 *
 * Purpose: Enable or disable a wakeup event
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     event_id : Event enumeration to change
 *     enable  : '1' to enable the event for wakeup, '0' to disable
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_wk_event_en_dis(CLKPWR_EVENT_T event_id,
                            INT_32 enable)
{
  volatile UNS_32 tmp;
  INT_32 bitnum = 0;
  CLKPWR_EVENTREG_GROUP_T *pRegs = NULL;

  if (clkpwr_get_event_field(event_id, pRegs, &bitnum) == 0)
  {
    /* Invalid */
    return;
  }

  tmp = *pRegs->start_er;
  if (enable != 0)
  {
    tmp |= _BIT(bitnum);
  }
  else
  {
    tmp &= ~_BIT(bitnum);
  }

  *pRegs->start_er = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_is_raw_event_active
 *
 * Purpose: Get the raw captured status of an event
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     event_id : Event enumeration to check
 *
 * Outputs: None
 *
 * Returns: '1' if the selected event is active, otherwise '0'
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 clkpwr_is_raw_event_active(CLKPWR_EVENT_T event_id)
{
  INT_32 event_sts = 0;
  INT_32 bitnum = 0;
  CLKPWR_EVENTREG_GROUP_T *pRegs = NULL;

  if (clkpwr_get_event_field(event_id, pRegs, &bitnum) != 0)
  {
    if ((*pRegs->start_rsr & _BIT(bitnum)) != 0)
    {
      event_sts = 1;
    }
  }

  return event_sts;
}

/***********************************************************************
 *
 * Function: clkpwr_is_msk_event_active
 *
 * Purpose: Get the masked captured status of an event
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     event_id : Event enumeration to check
 *
 * Outputs: None
 *
 * Returns: '1' if the selected event is active, otherwise '0'
 *
 * Notes: None
 *
 **********************************************************************/
INT_32 clkpwr_is_msk_event_active(CLKPWR_EVENT_T event_id)
{
  INT_32 event_sts = 0;
  INT_32 bitnum = 0;
  CLKPWR_EVENTREG_GROUP_T *pRegs = NULL;

  if (clkpwr_get_event_field(event_id, pRegs, &bitnum) == 0)
  {
    if ((*pRegs->start_sr & _BIT(bitnum)) != 0)
    {
      event_sts = 1;
    }
  }

  return event_sts;
}

/***********************************************************************
 *
 * Function: clkpwr_clear_event
 *
 * Purpose: Clear a captured event status
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     event_id : Event enumeration to  clear
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_clear_event(CLKPWR_EVENT_T event_id)
{
  INT_32 bitnum = 0;
  CLKPWR_EVENTREG_GROUP_T *pRegs = NULL;

  if (clkpwr_get_event_field(event_id, pRegs, &bitnum) == 0)
  {
    /* Invalid */
    return;
  }

  /* Clear selected event */
  *pRegs->start_rsr = _BIT(bitnum);
}

/***********************************************************************
 *
 * Function: clkpwr_set_event_pol
 *
 * Purpose:
 *     Set event signal polarity (0) = falling edge, (1) = rising edge
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     event_id : Event enumeration to set polarity of
 *     high     : '1' for high [polarity, '0' for low polarity
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_set_event_pol(CLKPWR_EVENT_T event_id,
                          INT_32 high)
{
  volatile UNS_32 tmp;
  INT_32 bitnum = 0;
  CLKPWR_EVENTREG_GROUP_T *pRegs = NULL;

  if (clkpwr_get_event_field(event_id, pRegs, &bitnum) == 0)
  {
    /* Invalid */
    return;
  }

  /* Set polarity high or low */
  tmp = *pRegs->start_apr & ~_BIT(bitnum);
  if (high != 0)
  {
    tmp |= _BIT(bitnum);
  }
  *pRegs->start_apr = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_get_uid
 *
 * Purpose:
 *     Returns the chip's unoqie ID into the passed array.
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     uid: Array to fill with 4 32-bit unique ID words
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_get_uid(UNS_32 uid[4]) {
	uid[0] = CLKPWR->clkpwr_uid[0];
	uid[1] = CLKPWR->clkpwr_uid[1];
	uid[2] = CLKPWR->clkpwr_uid[2];
	uid[3] = CLKPWR->clkpwr_uid[3];
}

/***********************************************************************
 *
 * Function: clkpwr_set_mux
 *
 * Purpose:
 *     Set a muxed GPO signal to it's default (0) or GPO state (1)
 *
 * Processing:
 *     Change the function of the selected muxed pin based on the
 *     passed input value.
 *
 * Parameters:
 *     mux_signal: Muxed signal enumeration to change
 *     mux1      : Set to non-zero value to enable muxed state
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_set_mux(CLKPWR_MUX_STATE_T mux_signal,
                    INT_32 mux1)
{
  switch (mux_signal)
  {
    case CLKPWR_HIGHCORE:
      if (mux1 == 0)
      {
        CLKPWR->clkpwr_pwr_ctrl &= ~CLKPWR_HIGHCORE_GPIO_EN;
      }
      else
      {
        CLKPWR->clkpwr_pwr_ctrl |= CLKPWR_HIGHCORE_GPIO_EN;
      }
      break;

    case CLKPWR_SYSCLKEN:
      if (mux1 == 0)
      {
        CLKPWR->clkpwr_pwr_ctrl &= ~CLKPWR_SYSCLKEN_GPIO_EN;
      }
      else
      {
        CLKPWR->clkpwr_pwr_ctrl |= CLKPWR_SYSCLKEN_GPIO_EN;
      }
      break;

    case CLKPWR_TEST_CLK1:
      if (mux1 == 0)
      {
        CLKPWR->clkpwr_test_clk_sel &=
          ~CLKPWR_TESTCLK_TESTCLK1_EN;
      }
      else
      {
        CLKPWR->clkpwr_test_clk_sel |=
          CLKPWR_TESTCLK_TESTCLK1_EN;
      }
      break;

