sobczyk/bsp/csps/lpc32xx/source/lpc32xx_clkpwr_driver.c
    case CLKPWR_TEST_CLK2:
      if (mux1 == 0)
      {
        CLKPWR->clkpwr_test_clk_sel &=
          ~CLKPWR_TESTCLK_TESTCLK2_EN;
      }
      else
      {
        CLKPWR->clkpwr_test_clk_sel |=
          CLKPWR_TESTCLK_TESTCLK2_EN;
      }
      break;

    case CLKPWR_SPI2_DATIO:
    case CLKPWR_SPI2_CLK_PAD:
      if (mux1 == 0)
      {
        CLKPWR->clkpwr_spi_clk_ctrl &= ~CLKPWR_SPICLK_USE_SPI2;
      }
      else
      {
        CLKPWR->clkpwr_spi_clk_ctrl |= CLKPWR_SPICLK_USE_SPI2;
      }
      break;

    case CLKPWR_SPI1_DATIO:
    case CLKPWR_SPI1_CLK_PAD:
      if (mux1 == 0)
      {
        CLKPWR->clkpwr_spi_clk_ctrl &= ~CLKPWR_SPICLK_USE_SPI1;
      }
      else
      {
        CLKPWR->clkpwr_spi_clk_ctrl |= CLKPWR_SPICLK_USE_SPI1;
      }
      break;

    default:
      break;
  }
}

/***********************************************************************
 *
 * Function: clkpwr_set_mux_state
 *
 * Purpose: Set a muxed signal to passed value
 *
 * Processing:
 *     Set a muxed signal state for the passed selections to the
 *     passed state.
 *
 * Parameters:
 *     mux_signal: Muxed signal enumeration to change
 *     state     : Value to set the GPO output to
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_set_mux_state(CLKPWR_MUX_STATE_T mux_signal,
                          INT_32 state)
{
  volatile UNS_32 tmp;

  switch (mux_signal)
  {
    case CLKPWR_HIGHCORE:
      if (state == 0)
      {
        CLKPWR->clkpwr_pwr_ctrl &= ~CLKPWR_HIGHCORE_STATE_BIT;
      }
      else
      {
        CLKPWR->clkpwr_pwr_ctrl |= CLKPWR_HIGHCORE_STATE_BIT;
      }
      break;

    case CLKPWR_SYSCLKEN:
      if (state == 0)
      {
        CLKPWR->clkpwr_pwr_ctrl &= ~CLKPWR_SYSCLKEN_STATE_BIT;
      }
      else
      {
        CLKPWR->clkpwr_pwr_ctrl |= CLKPWR_SYSCLKEN_STATE_BIT;
      }
      break;

    case CLKPWR_TEST_CLK1:
      tmp = (CLKPWR->clkpwr_test_clk_sel &
             ~CLKPWR_TESTCLK1_SEL_MASK) | (UNS_32) state;
      CLKPWR->clkpwr_test_clk_sel = tmp;
      break;

    case CLKPWR_TEST_CLK2:
      tmp = (CLKPWR->clkpwr_test_clk_sel &
             ~CLKPWR_TESTCLK2_SEL_MASK) | (UNS_32) state;
      CLKPWR->clkpwr_test_clk_sel = tmp;
      break;

    case CLKPWR_SPI2_DATIO:
      if (state == 0)
      {
        CLKPWR->clkpwr_spi_clk_ctrl &=
          ~CLKPWR_SPICLK_SET_SPI2DATIO;
      }
      else
      {
        CLKPWR->clkpwr_spi_clk_ctrl |=
          CLKPWR_SPICLK_SET_SPI2DATIO;
      }
      break;

    case CLKPWR_SPI2_CLK_PAD:
      if (state == 0)
      {
        CLKPWR->clkpwr_spi_clk_ctrl &=
          ~CLKPWR_SPICLK_SET_SPI2CLK;
      }
      else
      {
        CLKPWR->clkpwr_spi_clk_ctrl |=
          CLKPWR_SPICLK_SET_SPI2CLK;
      }
      break;

    case CLKPWR_SPI1_DATIO:
      if (state == 0)
      {
        CLKPWR->clkpwr_spi_clk_ctrl &=
          ~CLKPWR_SPICLK_SET_SPI1DATIO;
      }
      else
      {
        CLKPWR->clkpwr_spi_clk_ctrl |=
          CLKPWR_SPICLK_SET_SPI1DATIO;
      }
      break;

    case CLKPWR_SPI1_CLK_PAD:
      if (state == 0)
      {
        CLKPWR->clkpwr_spi_clk_ctrl &=
          ~CLKPWR_SPICLK_SET_SPI1CLK;
      }
      else
      {
        CLKPWR->clkpwr_spi_clk_ctrl |=
          CLKPWR_SPICLK_SET_SPI1CLK;
      }
      break;

    default:
      break;
  }
}

/***********************************************************************
 *
 * Function: clkpwr_setup_mcard_ctrlr
 *
 * Purpose: Memory card (MSSDIO) pad and clock setup
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     enable_pullups   : '1 to enable all pullups, '0' to disable
 *     dat2_3_pullup_on : '1' to enable pullups on data 2 and 3 pads
 *     dat1_pullup_on   : '1' to enable pullups on data 1 pad
 *     dat0_pullup_on   : '1' to enable pullups on data 0 pad
 *     freq_div         : 'Must be 1 to 15, or 0 to disable
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_setup_mcard_ctrlr(INT_32 enable_pullups,
                              INT_32 dat2_3_pullup_on,
                              INT_32 dat1_pullup_on,
                              INT_32 dat0_pullup_on,
                              INT_32 freq_div)
{
  UNS_32 tmp;

  tmp = CLKPWR->clkpwr_ms_ctrl & CLKPWR_MSCARD_SDCARD_EN;
  if (enable_pullups != 0)
  {
    tmp |= CLKPWR_MSCARD_MSDIO_PU_EN;
  }
  if (dat2_3_pullup_on == 0)
  {
    tmp |= CLKPWR_MSCARD_MSDIO23_DIS;
  }
  if (dat1_pullup_on == 0)
  {
    tmp |= CLKPWR_MSCARD_MSDIO1_DIS;
  }
  if (dat0_pullup_on == 0)
  {
    tmp |= CLKPWR_MSCARD_MSDIO0_DIS;
  }
  tmp |= CLKPWR_MSCARD_SDCARD_DIV(freq_div);
  CLKPWR->clkpwr_ms_ctrl = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_setup_pwm
 *
 * Purpose: Set the drive strength of I2C signals
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     i2c_num : Must be 1 or 2
 *     high    : '1' for high driver
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_set_i2c_driver(INT_32 i2c_num,
                           INT_32 high)
{
  volatile UNS_32 tmp;

  if (i2c_num == 1)
  {
    tmp = CLKPWR->clkpwr_i2c_clk_ctrl & ~CLKPWR_I2CCLK_I2C1HI_DRIVE;
    if (high != 0)
    {
      tmp |= CLKPWR_I2CCLK_I2C1HI_DRIVE;
    }
    CLKPWR->clkpwr_i2c_clk_ctrl = tmp;
  }
  else if (i2c_num == 2)
  {
    tmp = CLKPWR->clkpwr_i2c_clk_ctrl & ~CLKPWR_I2CCLK_I2C2HI_DRIVE;
    if (high != 0)
    {
      tmp |= CLKPWR_I2CCLK_I2C2HI_DRIVE;
    }
    CLKPWR->clkpwr_i2c_clk_ctrl = tmp;
  }
}

/***********************************************************************
 *
 * Function: clkpwr_setup_pwm
 *
 * Purpose:
 *     Configure PWM 1 or 2 with a clock source and divider value
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     pwm_num  : Must be 1 or 2
 *     clk_src  : '0' for 32KHz clock, 1 for PERIPH_CLK
 *     freq_dev : Must be 1 to 15, or 0 to disable
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_setup_pwm(INT_32 pwm_num,
                      INT_32 clk_src,
                      INT_32 freq_dev)
{
  volatile UNS_32 tmp;

