sobczyk/bsp/csps/lpc32xx/source/lpc32xx_clkpwr_driver.c
  if (pwm_num == 1)
  {
    tmp = CLKPWR->clkpwr_pwm_clk_ctrl &
          ~(CLKPWR_PWMCLK_PWM1_DIV(0xF) | CLKPWR_PWMCLK_PWM1SEL_PCLK);
    if (clk_src != 0)
    {
      tmp |= CLKPWR_PWMCLK_PWM1SEL_PCLK;
    }
    tmp |= CLKPWR_PWMCLK_PWM1_DIV(freq_dev);
    CLKPWR->clkpwr_pwm_clk_ctrl = tmp;
  }
  else if (pwm_num == 2)
  {
    tmp = CLKPWR->clkpwr_pwm_clk_ctrl &
          ~(CLKPWR_PWMCLK_PWM2_DIV(0xF) | CLKPWR_PWMCLK_PWM2SEL_PCLK);
    if (clk_src != 0)
    {
      tmp |= CLKPWR_PWMCLK_PWM2SEL_PCLK;
    }
    tmp |= CLKPWR_PWMCLK_PWM2_DIV(freq_dev);
    CLKPWR->clkpwr_pwm_clk_ctrl = tmp;
  }
}

/***********************************************************************
 *
 * Function: clkpwr_setup_nand_ctrlr
 *
 * Purpose: NAND FLASH controller setup (except clocks)
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     use_slc            : '1' for SLC, '0' for MLC
 *     use_dma_req_on_rnb : Enable DMA_REQ signal on NAND_RnB
 *     use_dma_req_on_int : Enable DMA_REQ signal on NAND_INT
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_setup_nand_ctrlr(INT_32 use_slc,
                             INT_32 use_dma_req_on_rnb,
                             INT_32 use_dma_req_on_int)
{
  UNS_32 tmp;

  if (use_slc != 0)
  {
    /* Select SLC interface and SLC interrupt */
    tmp = CLKPWR_NANDCLK_SEL_SLC;
  }
  else
  {
    /* Select MLC interface and MLC interrupt */
    tmp = CLKPWR_NANDCLK_INTSEL_MLC;
  }

  /* Enable DMA support */
  if (use_dma_req_on_rnb != 0)
  {
    tmp |= CLKPWR_NANDCLK_DMA_RNB;
  }
  if (use_dma_req_on_int != 0)
  {
    tmp |= CLKPWR_NANDCLK_DMA_INT;
  }

  CLKPWR->clkpwr_nand_clk_ctrl = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_setup_adc_ts
 *
 * Purpose: ADC/touchscreen controller setup
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     sel_periph_clk : '1' for PERIPH_CLK, '0' for RTC
 *     clkdiv         : ADC clock divider, 0 to 15, or 0 for off
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_setup_adc_ts(INT_32 sel_periph_clk,
                         INT_32 clkdiv)
{
  UNS_32 tmp;

  tmp = CLKPWR_ADCCTRL1_RTDIV(clkdiv);
  if (sel_periph_clk != 0)
  {
    tmp |= CLKPWR_ADCCTRL1_PCLK_SEL;
  }

  CLKPWR->clkpwr_adc_clk_ctrl_1 = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_setup_ssp
 *
 * Purpose: SSP controller setup
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     ssp1_rx_dma_en : 1 = Enable SSP1 RX DMA, 0 = disable
 *     ssp1_tx_dma_en : 1 = Enable SSP1 RX DMA, 0 = disable
 *     ssp0_rx_dma_en : 1 = Enable SSP1 RX DMA, 0 = disable
 *     ssp0_tx_dma_en : 1 = Enable SSP1 RX DMA, 0 = disable
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: Enabling SSP DMA will disable DMA for SPI peripherals.
 *
 **********************************************************************/
void clkpwr_setup_ssp(INT_32 ssp1_rx_dma_en,
                      INT_32 ssp1_tx_dma_en,
                      INT_32 ssp0_rx_dma_en,
                      INT_32 ssp0_tx_dma_en)
{
  volatile UNS_32 tmp;

  tmp = CLKPWR->clkpwr_ssp_blk_ctrl & ~(CLKPWR_SSPCTRL_DMA_SSP1RX |
    CLKPWR_SSPCTRL_DMA_SSP1TX | CLKPWR_SSPCTRL_DMA_SSP0RX |
    CLKPWR_SSPCTRL_DMA_SSP0TX);
  if (ssp1_rx_dma_en != 0)
  {
    tmp |= CLKPWR_SSPCTRL_DMA_SSP1RX;
  }
  if (ssp1_tx_dma_en != 0)
  {
    tmp |= CLKPWR_SSPCTRL_DMA_SSP1TX;
  }
  if (ssp0_rx_dma_en != 0)
  {
    tmp |= CLKPWR_SSPCTRL_DMA_SSP0RX;
  }
  if (ssp0_tx_dma_en != 0)
  {
    tmp |= CLKPWR_SSPCTRL_DMA_SSP0TX;
  }

  CLKPWR->clkpwr_ssp_blk_ctrl = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_setup_i2s
 *
 * Purpose: I2S controller setup
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     i2s1_tx_clk_from_rx : 1 = I2S1 TX clock = RX clock, 0 = swap
 *     i2s1_rx_clk_from_tx : 1 = I2S1 RX clock = TX clock, 0 = swap
 *     i2s1_use_dma        : 1 = Enable I2S1 RX DMA, 0 = UART7 DMA
 *     i2s0_rx_clk_from_tx : 1 = I2S0 TX clock = RX clock, 0 = swap
 *     i2s0_tx_clk_from_rx : 1 = I2S0 RX clock = TX clock, 0 = swap
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: Enabling I2S1 DMA will disable DMA for UART7 peripherals.
 *
 **********************************************************************/
void clkpwr_setup_i2s(INT_32 i2s1_tx_clk_from_rx,
                      INT_32 i2s1_rx_clk_from_tx,
                      INT_32 i2s1_use_dma,
                      INT_32 i2s0_rx_clk_from_tx,
                      INT_32 i2s0_tx_clk_from_rx)
{
  volatile UNS_32 tmp;

  tmp = CLKPWR->clkpwr_i2s_clk_ctrl & ~(CLKPWR_I2SCTRL_I2S1_RX_FOR_TX |
    CLKPWR_I2SCTRL_I2S1_TX_FOR_RX | CLKPWR_I2SCTRL_I2S1_USE_DMA |
    CLKPWR_I2SCTRL_I2S0_RX_FOR_TX | CLKPWR_I2SCTRL_I2S0_TX_FOR_RX);
  if (i2s1_tx_clk_from_rx != 0)
  {
    tmp |= CLKPWR_I2SCTRL_I2S1_RX_FOR_TX;
  }
  if (i2s1_rx_clk_from_tx != 0)
  {
    tmp |= CLKPWR_I2SCTRL_I2S1_TX_FOR_RX;
  }
  if (i2s1_use_dma != 0)
  {
    tmp |= CLKPWR_I2SCTRL_I2S1_USE_DMA;
  }
  if (i2s0_tx_clk_from_rx != 0)
  {
    tmp |= CLKPWR_I2SCTRL_I2S0_RX_FOR_TX;
  }
  if (i2s0_rx_clk_from_tx != 0)
  {
    tmp |= CLKPWR_I2SCTRL_I2S0_TX_FOR_RX;
  }

  CLKPWR->clkpwr_i2s_clk_ctrl = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_setup_lcd
 *
 * Purpose: LCD controller setup
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     lcdpins    : Select pin mux group
 *     clkdiv     : Must be 1 to 32
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_setup_lcd(LCD_PIN_MUX_T lcdpins,
                      INT_32 clkdiv)
{
  volatile UNS_32 tmp;

  tmp = CLKPWR->clkpwr_lcdclk_ctrl & ~(CLKPWR_LCDCTRL_LCDTYPE_MSK |
                                       CLKPWR_LCDCTRL_PSCALE_MSK);
  switch (lcdpins)
  {
    case CLKPWR_LCDMUX_TFT12:
      tmp = CLKPWR_LCDCTRL_LCDTYPE_TFT12;
      break;

    case CLKPWR_LCDMUX_TFT16:
      tmp = CLKPWR_LCDCTRL_LCDTYPE_TFT16;
      break;

    case CLKPWR_LCDMUX_TFT15:
      tmp = CLKPWR_LCDCTRL_LCDTYPE_TFT15;
      break;

    case CLKPWR_LCDMUX_TFT24:
      tmp = CLKPWR_LCDCTRL_LCDTYPE_TFT24;
      break;

    case CLKPWR_LCDMUX_STN4M:
      tmp = CLKPWR_LCDCTRL_LCDTYPE_STN4M;
      break;

