sobczyk/bsp/csps/lpc32xx/source/lpc32xx_clkpwr_driver.c
    case CLKPWR_LCDMUX_STN8C:
      tmp = CLKPWR_LCDCTRL_LCDTYPE_STN8C;
      break;

    case CLKPWR_LCDMUX_DSTN4M:
      tmp = CLKPWR_LCDCTRL_LCDTYPE_DSTN4M;
      break;

    case CLKPWR_LCDMUX_DSTN8C:
      tmp = CLKPWR_LCDCTRL_LCDTYPE_DSTN8C;
      break;

    default:
      break;
  }

  /* Prescaler */
  tmp |= CLKPWR_LCDCTRL_SET_PSCALE(clkdiv);
  CLKPWR->clkpwr_lcdclk_ctrl = tmp;
}

/***********************************************************************
 *
 * Function: clkpwr_select_enet_iface
 *
 * Purpose: Ethernet enable and select MII/RMII interface selection
 *
 * Processing:
 *     See function.
 *
 * Parameters:
 *     enable   : 1 = enable, 0 = disable
 *     use_rmii : 1 = RMII, 0 = MII
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes: None
 *
 **********************************************************************/
void clkpwr_select_enet_iface(INT_32 enable,
                              INT_32 use_rmii)
{
  volatile UNS_32 tmp;

  tmp = CLKPWR->clkpwr_macclk_ctrl & ~CLKPWR_MACCTRL_PINS_MSK;
  if (enable == 0)
  {
    tmp |= CLKPWR_MACCTRL_NO_ENET_PIS;
  }
  else if (use_rmii == 0)
  {
    tmp |= CLKPWR_MACCTRL_USE_RMII_PINS;
  }
  else
  {
    tmp |= CLKPWR_MACCTRL_USE_MII_PINS;
  }

  CLKPWR->clkpwr_macclk_ctrl = tmp;
}



/***********************************************************************
 *
 * Function: clkpwr_halt_cpu
 *
 * Purpose: Enter low power mode (clocks disabled) in the CPU core
 *
 * Processing:
 *     Issue the coprocessor CP15 command to the CPU core to halt the
 *     CPU clocks until an interrupt occurs.
 *
 * Parameters: None
 *
 * Outputs: None
 *
 * Returns: Nothing
 *
 * Notes:
 *     See the ARM926EJ-S TRM for more information on the wait
 *     for inetrrupt command.
 *
 **********************************************************************/
void clkpwr_halt_cpu(void)
{
  register UNS_32 status = 0;

  /* Read the MMU control register */
#ifdef __GNUC__
asm("MCR p15, 0, %0, c7, c0, 4" : "=r"(status));
#endif
#ifdef __arm
  __asm
  {
    MCR p15, 0, status, c7, c0, 4;
  }
#endif
#ifdef __ICCARM__
  /* IAR CC includes some "intrinsic" functions to access ARM CP regs */
  __MCR(15, 0, status, 7, 0, 4);
#endif
}
